models/admin/Admin.php

SELECT `au`.*, `ag`.`name` AS `groupName` FROM `yii_admin_user` `au` LEFT JOIN `yii_admin_user_group` `ag` ON au.group_id=ag.group_id WHERE (`au`.`uid`='1') AND (`au`.`status`=1) AND (`ag`.`status`=1)
---
    public static function findIdentity($uid)
    {
        return static::find()
            ->select('au.*,ag.name groupName')
            ->from('yii_admin_user au')
            ->leftJoin('yii_admin_user_group ag', 'au.group_id=ag.group_id')
            ->where(['au.uid' => $uid, 'au.status' => self::STATUS_ACTIVE, 'ag.status' => self::STATUS_ACTIVE])
            ->one();

SELECT `au`.*, `ag`.`name` AS `groupName` FROM `yii_admin_user` `au` LEFT JOIN `yii_admin_user_group` `ag` ON au.group_id=ag.group_id WHERE (`au`.`username`='admin') AND (`au`.`status`=1) AND (`ag`.`status`=1)
---
    public static function findByUsername($username)
    {
        return static::find()
            ->select('au.*,ag.name groupName')
            ->from('yii_admin_user au')
            ->leftJoin('yii_admin_user_group ag', 'au.group_id=ag.group_id')
            ->where(['au.username' => $username, 'au.status' => self::STATUS_ACTIVE, 'ag.status' => self::STATUS_ACTIVE])
            ->one();